In [7]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from config import username, password, database

from sqlalchemy import create_engine, inspect

In [8]:
# Create Database Connection
engine = create_engine(f"postgresql://{username}:{password}@localhost:5432/{database}")
conn = engine.connect()

In [9]:
# Create the inspector and connect it to the engine
inspector = inspect(engine)
inspector.get_table_names()

['employees', 'departments', 'dept_emp', 'dept_manager', 'salaries', 'titles']

In [14]:
#Create a dataframe shows salaries
salaries = pd.read_sql("SELECT * FROM salaries ORDER BY emp_no", conn)

salaries.head(10)

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228
5   10006   40000
6   10007   56724
7   10008   46671
8   10009   60929
9   10010   72488